{
  "summary": "Allele-specific strand bias estimated by the symmetric odds ratio test (AS_SOR)",
  "arguments": [],
  "description": "Allele-specific strand bias estimated by the Symmetric Odds Ratio test\n\n \u003cp\u003eStrand bias is a type of sequencing bias in which one DNA strand is favored over the other, which can result in\n incorrect evaluation of the amount of evidence observed for one allele vs. the other. The AS_StrandOddsRatio\n annotation is one of several methods that aims to evaluate whether there is strand bias in the data. It is an\n updated form of the Fisher Strand Test that is better at taking into account large amounts of data in high coverage\n situations. It is used to determine if there is strand bias between forward and reverse strands for the reference or\n alternate allele. It does so separately for each allele. The reported value is ln-scaled.\u003c/p\u003e\n\n \u003ch3\u003eStatistical notes\u003c/h3\u003e\n \u003cp\u003eThe following 2x2 contingency table gives the notation for allele support and strand orientation.\u003c/p\u003e\n\n \u003ctable\u003e\n \u003ctr\u003e\u003cth\u003e\u0026nbsp;\u003c/th\u003e\u003cth\u003e+ strand\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/th\u003e\u003cth\u003e- strand\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/th\u003e\u003c/tr\u003e\n \u003ctr\u003e\u003cth\u003eREF\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/th\u003e\u003ctd\u003eX[0][0]\u003c/td\u003e\u003ctd\u003eX[0][1]\u003c/td\u003e\u003c/tr\u003e\n \u003ctr\u003e\u003cth\u003eALT\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/th\u003e\u003ctd\u003eX[1][0]\u003c/td\u003e\u003ctd\u003eX[1][1]\u003c/td\u003e\u003c/tr\u003e\n \u003c/table\u003e\n\n \u003cp\u003eWe can then represent the Odds Ratios with the equation:\u003c/p\u003e\n\n \u003cimg src\u003d\"http://latex.codecogs.com/svg.latex?R \u003d \\frac{X[0][0] * X[1][1]}{X[0][1] * X[1][0]}\" border\u003d\"0\"/\u003e\n\n \u003cp\u003eand its inverse:\u003c/p\u003e\n\n \u003cimg src\u003d\"http://latex.codecogs.com/svg.latex?\\frac{1}{R} \u003d \\frac{X[0][1] * X[1][0]}{X[0][0] * X[1][1]}\" border\u003d\"0\"/\u003e\n\n \u003cp\u003eThe sum R + 1/R is used to detect a difference in strand bias for REF and for ALT. The sum makes it symmetric.\n A high value is indicative of large difference where one entry is very small compared to the others. A scale factor\n of refRatio/altRatio where\u003c/p\u003e\n\n \u003cimg src\u003d\"http://latex.codecogs.com/svg.latex?refRatio \u003d \\frac{min(X[0][0], X[0][1])}{max(X[0][0], X[0][1])}\" border\u003d\"0\"/\u003e\n\n \u003cp\u003eand \u003c/p\u003e\n\n \u003cimg src\u003d\"http://latex.codecogs.com/svg.latex?altRatio \u003d \\frac{min(X[1][0], X[1][1])}{max(X[1][0], X[1][1])}\" border\u003d\"0\"/\u003e\n\n \u003cp\u003eensures that the annotation value is large only. The final SOR annotation is given in natural log space.\u003c/p\u003e\n\n \u003cp\u003eSee the \u003ca href\u003d\"http://www.broadinstitute.org/gatk/guide/article?id\u003d4732\"\u003emethod document on statistical tests\u003c/a\u003e\n for a more detailed explanation of this statistical test, and see\n \u003ca href\u003d\"https://software.broadinstitute.org/gatk/documentation/tooldocs/current/org_broadinstitute_hellbender_tools_walkers_annotator_StrandOddsRatio.php\"\u003eStrandOddsRatio\u003c/a\u003e\n documentation for an example calculation.\u003c/p\u003e\n\n \u003ch3\u003eCaveat\u003c/h3\u003e\n \u003cp\u003e\n The name AS_StrandOddsRatio is not entirely appropriate because the implementation was changed somewhere between the start of development and release of this annotation. Now SOR isn\u0027t really an odds ratio anymore. The goal was to separate certain cases of data without penalizing variants that occur at the ends of exons because they tend to only be covered by reads in one direction (depending on which end of the exon they\u0027re on), so if a variant has 10 ref reads in the + direction, 1 ref read in the - direction, 9 alt reads in the + direction and 2 alt reads in the - direction, it\u0027s actually not strand biased, but the FS score is pretty bad. The implementation that resulted derived in part from empirically testing some read count tables of various sizes with various ratios and deciding from there.\u003c/p\u003e\n\n \u003ch3\u003eRelated annotations\u003c/h3\u003e\n \u003cul\u003e\n     \u003cli\u003e\u003cb\u003eAS_FisherStrand\u003c/b\u003e uses Fisher\u0027s Exact Test to evaluate strand bias.\u003c/li\u003e\n     \u003cli\u003e\u003cb\u003eStrandOddsRatio\u003c/b\u003e outputs a version of this annotation that includes all alternate alleles in a single calculation.\u003c/li\u003e\n     \u003cli\u003e\u003cb\u003eStrandBiasBySample\u003c/b\u003e outputs counts of read depth per allele for each strand orientation.\u003c/li\u003e\n\n \u003c/ul\u003e",
  "name": "AS_StrandOddsRatio",
  "group": "Variant Annotations",
  "beta": false,
  "experimental": false
}