{
  "summary": "Likelihood-based test for the consanguinity among samples (InbreedingCoeff)",
  "arguments": [],
  "description": "Likelihood-based test for the consanguinuity among samples\n\n \u003cp\u003eThis annotation estimates whether there is evidence of consanguinuity in a population. The higher the score, the\n higher the chance that some samples are related. If samples are known to be related, a pedigree file can be provided so\n that the calculation is only performed on founders and offspring are excluded.\u003c/p\u003e\n\n \u003ch3\u003eDetails\u003c/h3\u003e\n \u003cp\u003eThe output is the inbreeding coefficient \u0027F\u0027 (fixation) statistic, which for large sample sizes converges to the probability\n that an individual\u0027s two alleles are identical by descent, provided that consanguinity is the only source of deviation from Hardy-Weinberg equilibrium.\n If this assumption is not true F may be negative and the excess heterozygosity often indicates an artifactual variant.\n It is calculated as F \u003d 1 - (# of het genotypes)/(# of het genotypes expected under Hardy-Weinberg equilibrium).  The number of het genotypes expected under Hardy-Weinberg equilibrium\n is 2*(# of samples)*(ref allele frequency)*(alt allele frequency), where allele frequencies are calculated from the samples\u0027 genotypes.\u003c/p\u003e\n\n \u003ch3\u003eCaveats\u003c/h3\u003e\n \u003cul\u003e\n \u003cli\u003eThe Inbreeding Coefficient annotation can only be calculated for cohorts containing at least 10 founder samples.\u003c/li\u003e\n \u003cli\u003eThe Inbreeding Coefficient annotation can only be calculated for diploid samples.\u003c/li\u003e\n \u003cli\u003eThe implementation here uses likelihoods rather than counts, so computed InbreedingCoeff values can be sensitive to small\n changes in the low GQ range, as might happen after \"reblocking\" low coverage sites, as well as GQ0 versus no-call changes\u003c/li\u003e\n \u003c/ul\u003e\n\n \u003ch3\u003eRelated annotations\u003c/h3\u003e\n \u003cp\u003e\u003cb\u003eExcessHet\u003c/b\u003e also describes the heterozygosity of the called samples, giving a probability of excess heterozygosity being observed\u003c/p\u003e",
  "name": "InbreedingCoeff",
  "group": "Variant Annotations",
  "beta": false,
  "experimental": false
}