{
  "summary": "Phred-scaled p-value for exact test of excess heterozygosity (ExcessHet)",
  "arguments": [],
  "description": "Phred-scaled p-value for exact test of excess heterozygosity.\n\n \u003cp\u003eThis annotation estimates the probability of the called samples exhibiting excess heterozygosity with respect to the null hypothesis that the samples are unrelated. The higher the score, the\n higher the chance that the variant is a technical artifact or that there is consanguinuity among the samples. In\n contrast to Inbreeding Coefficient, there is no minimal number of samples for this annotation. If samples are known to be related, a pedigree file can be provided so\n that the calculation is only performed on founders and offspring are excluded.\u003c/p\u003e\n\n \u003ch3\u003eStatistical notes\u003c/h3\u003e\n \u003cp\u003eThis annotation uses the implementation from\n \u003ca href\u003d\u0027https://doi.org/10.1086/429864\u0027\u003eWigginton, Cutler, and Abecasis 2005.\u003c/a\u003e\n to calculate a right-sided p-value (the probability of getting the observed number of heterozygotes or higher).\n \u003cp\u003eHowever, note that in releases prior to and including GATK 4.2.3.0, an additional mid-p correction\n not discussed in that reference was applied. That is, if n_{AB} is the observed number of heterozygous genotypes,\n N is the total number of samples, and n_A is the number of minor alleles, then the p-value was previously reported as:\n \\sum_{N_{AB} \u003d n_{AB}}^{N} P(N_{AB} | N, n_A) - P(n_{AB} | N, n_A) / 2.\n Similar mid-p corrections are discussed in e.g. \u003ca href\u003d\u0027https://doi.org/10.1515/sagmb-2012-0039\u0027\u003eGraffelman and Moreno 2013\u003c/a\u003e.\u003c/p\u003e\n \u003cp\u003eThis mid-p correction was removed in subsequent releases, so that the p-value is now reported as:\n \\sum_{N_{AB} \u003d n_{AB}}^{N} P(N_{AB} | N, n_A). This p-value is thus concordant with the P_{high} p-value\n discussed by Wigginton et al., as well as the ExcHet annotation reported by\n \u003ca href\u003d\u0027https://samtools.github.io/bcftools/howtos/plugin.fill-tags.html\u0027\u003ebcftools\u003c/a\u003e.\u003c/p\u003e\n \u003cp\u003eSee discussion at the corresponding GitHub\n \u003ca href\u003d\u0027https://github.com/broadinstitute/gatk/issues/7392\u0027\u003eissue\u003c/a\u003e and\n \u003ca href\u003d\u0027https://github.com/broadinstitute/gatk/pull/7394\u0027\u003epull request\u003c/a\u003e.\u003c/p\u003e\n\n \u003ch3\u003eCaveat\u003c/h3\u003e\n \u003cp\u003eThe Excess Heterozygosity annotation can only be calculated for diploid samples.\u003c/p\u003e\n\n \u003ch3\u003eRelated annotations\u003c/h3\u003e\n \u003cp\u003e\u003cb\u003eInbreedingCoeff\u003c/b\u003e also describes the heterozygosity of the called samples, though without explicitly taking into account the number of samples\u003c/p\u003e",
  "name": "ExcessHet",
  "group": "Variant Annotations",
  "beta": false,
  "experimental": false
}